# Prática - Banco de Dados com SQLite
Ao final desse módulo, você estará apto a:

* Conectar um banco de dados;
* Criar e manipular tabelas;
* Selecionar informações no banco de dados;
* Utilização de operadores de comparação, lógicos e aritméticos;
* Agrupar informações via SQL;
* Relacionar tabelas entre tabelas.

## 1. Primeiros passos
Aprenda a conectar o SQLite com python e teste alguns comandos básicos.

### Criando o primeiro banco de dados

In [20]:
import sqlite3
# Conectando um banco de dados
#banco = sqlite3.connect(':memory:')
banco = sqlite3.connect('empresa.db')

* Um **cursor** é como um identificador de arquivo que podemos usar para executar operações nos dados armazenados no banco de dados. 
* Chamar cursor() é muito semelhante conceitualmente a chamar open() ao lidar com arquivos de texto. 
* Uma vez que temos o cursor, podemos começar a executar comandos no conteúdo do banco de dados usando o método execute().

In [21]:
# Criando um cursor para operar comandos SQL
cursor = banco.cursor()

### Criando e preenchendo uma tabela

In [22]:
# Criando uma tabela 'estudantes' com as campos nomeEstudante, idade, email
cursor.execute("CREATE TABLE estudantes (idEstudante integer, nomeEstudante text, idade integer, email text, idDepartamento integer)")
# Inserindo dados na tabela
cursor.execute("INSERT INTO estudantes VALUES(1, 'Maria', 40,'mariadosanjos@mentorama.com',2)")
banco.commit()

### Consultando dados

In [23]:
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print (cursor.fetchall())

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2)]

## 2. Manipulando dados com SQLite
Nesta etapa iremos avançar um pouco mais nas operações SQL, a fim de manipular os dados das nossas tabelas

### Inserindo n dados em uma tabela
Inserir vários dados a partir de uma lista, pode econonomizar bastante tempo ao automatizar o processo de

In [24]:
# Primeiro criamos uma lista com conteúdo a ser inserido, na mesma ordem dos tipos de dados definidos
listaestudantes = [('2','Felipe', '18', 'felipe@mentorama.com','1'),
         ('3','Maria', '45', 'maria@mentorama.com','4'),
         ('4','João', '33', 'joao@mentorama.com','4'),
         ('5','Lucia', '17', 'lucia@mentorama.com','2'),
         ('6','Pedro','32','pedro@mentorama.com','NULL'),
         ('7','Izabela', '23','izabela@mentorama.com','3'),
         ('8','Eduardo', '59', 'eduardo@mentorama.com','4'),
         ('9','Tiago', '38', 'tiago@mentorama.com','5'),
         ('10','Ana', '25', 'ana@mentorama.com','NULL'),
         ('11','Carol','36','carol@mentorama.com','2'),
         ('12','Leonardo', '28','leonardo@mentorama.com','3'),
         ('13','Vanessa', '45', 'vanessa@mentorama.com','4'),
         ('14','João', '43', 'joaopedro@mentorama.com','5'),
         ('15','Mari', '25', 'mari@mentorama.com','6')]

In [25]:
# Inserimos os dados da lista dentro da tabela
cursor.executemany("""INSERT INTO estudantes VALUES (?,?,?,?,?)""", listaestudantes)
print ("Dados inseridos com sucesso!")
banco.commit()

Dados inseridos com sucesso!

In [26]:
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print (cursor.fetchall())
print("Dados inseridos com sucesso!")

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2), (2, 'Felipe', 18, 'felipe@mentorama.com', 1), (3, 'Maria', 45, 'maria@mentorama.com', 4), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]
Dados inseridos com sucesso!

### Atualizando registros

* Usamos o comando **UPDATE** do SQL para atualizar nossa tabela estudantes. Você pode usar SET para mudar um campo, neste caso mudamos o campo nome para “Diego”, para todo registro onde o campo nome era “Felipe”. 
* Vale lembrar que se você não confirmar as mudanças com o commit, suas mudanças não serão escritas no banco de dados e não terão efeito.

In [14]:
# Criamos o comando sql e depois executamos com o cursor
sql = """
UPDATE estudantes
SET nomeEstudante = 'Felipe'
WHERE nomeEstudante = 'Diego'
"""
cursor.execute(sql)
banco.commit()
print("Registros atualizados com sucesso!")

Registros atualizados com sucesso!

In [27]:
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print (cursor.fetchall())

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2), (2, 'Felipe', 18, 'felipe@mentorama.com', 1), (3, 'Maria', 45, 'maria@mentorama.com', 4), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]

### Deletando registros
Deletar também é fácil. Perceba que o sql só tem 2 linhas! Neste caso, tudo o que temos que fazer é dizer para o SQLite qual tabela (estudantes) e quais registros deletar, usando a cláusula WHERE. O comando do exemplo apaga todo e qualquer registro que tenha “Maria” no campo nome.

In [16]:
sql = """
DELETE FROM estudantes
WHERE nomeEstudante = 'Maria'
"""
cursor.execute(sql)
banco.commit()
print("Registros deletados com sucesso!")
# http://pythonclub.com.br/gerenciando-banco-dados-sqlite3-python-parte2.html
# https://support.zendesk.com/hc/pt-br/articles/203691016-Formata%C3%A7%C3%A3o-de-texto-com-Markdown#topic_xqx_mvc_43__row_ppv_wln_1n

Registros deletados com sucesso!

In [17]:
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print (cursor.fetchall())

[(2, 'Felipe', 18, 'felipe@mentorama.com', 1), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]

### Deletando uma tabela
Muita atenção neste comando pois você pode perder todos os dados da sua tabela.

In [18]:
sql = """
DROP TABLE estudantes
"""
cursor.execute(sql)
banco.commit()
print("Tabela deletada com sucesso!")

Tabela deletada com sucesso!

In [19]:
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print (cursor.fetchall())

OperationalError: no such table: estudantes

### WHERE
O comando Select tem uma série de variações, a fim de manipular e filtrar bem a consulta. Veja como podemos trabalhar com o WHERE e outras variações. Vamos ver alguns exemplos:

* Vamos selecionar dados da tabela estudantes onde a idade é especificada.
* Observe que usar * indica que você deseja que o banco de dados retorne todas as colunas para cada linha que corresponda à cláusula WHERE.

In [28]:
# Seleciona dados da tabela estudantes onde a idade é especificada 
cursor.execute("""SELECT * FROM estudantes 
               WHERE idade = '33'""")
print (cursor.fetchall())

[(4, 'João', 33, 'joao@mentorama.com', 4)]

* Vamos selecionar dados da tabela estudantes onde o nome é especificado

In [30]:
# Seleciona dados da tabela estudantes onde o nome é especificado 
cursor.execute("""SELECT * FROM estudantes 
               WHERE nomeEstudante = 'Diego'""")
print (cursor.fetchall())

[]

In [31]:
# Consulta dados da tabela 'estudantes'
cursor.execute("SELECT * FROM estudantes")
print (cursor.fetchall())

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2), (2, 'Felipe', 18, 'felipe@mentorama.com', 1), (3, 'Maria', 45, 'maria@mentorama.com', 4), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]

### Operadores Lógicos AND, OR e NOT e Operadores de Comparação (>, <, >=,<=, ==) etc...
A cláusula WHERE pode ser combinada com os operadores AND, OR e NOT.

Os operadores AND e OR são usados para filtrar registros com base em mais de uma condição:

* O operador AND exibe um registro se todas as condições separadas por AND forem verdadeiras.
* O operador OR exibe um registro se alguma das condições separadas por OR for TRUE.
* O operador NOT exibe um registro se as condições NÃO forem verdadeiras.

Vamos usar o operador **AND**
* Vamos selecionar dados da tabela estudantes onde o nome e a idade são especificados

In [33]:
# Seleciona dados da tabela estudantes onde o nome e a idade são especificados 
cursor.execute("SELECT * FROM estudantes WHERE nomeEstudante = 'Diego' AND idade = '18'") 
# Teste também com Diego
print (cursor.fetchall())

[]

Vamos usar o operador **OR**
* Vamos selecionar dados da tabela estudantes onde queremos retornar os registros que tenham o nome Maria OU possuam idade = 18

In [39]:
cursor.execute("SELECT * FROM estudantes WHERE nomeEstudante = 'Maria' OR idade = '18'")
print (cursor.fetchall())

[(1, 'Maria', 40, 'mariadosanjos@mentorama.com', 2), (3, 'Maria', 45, 'maria@mentorama.com', 4)]

Vamos usar o operador **NOT**
* Vamos selecionar dados da tabela estudantes e retornar todos os registros que não tenham o nome Maria ou que a idade seja = 18

In [41]:
cursor.execute("SELECT * FROM estudantes WHERE NOT nomeEstudante = 'Maria'OR idade = '18'")
print (cursor.fetchall())

[(2, 'Felipe', 18, 'felipe@mentorama.com', 1), (4, 'João', 33, 'joao@mentorama.com', 4), (5, 'Lucia', 17, 'lucia@mentorama.com', 2), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]

Vamos combinar os operados **NOT, AND, OR** com operadores de comparação **>**
* Vamos selecionar dados da tabela estudantes e retornar todos os registros cujo nome não seja Maria E que a idade seja maior que 18

In [42]:
cursor.execute("SELECT * FROM estudantes WHERE NOT nomeEstudante = 'Maria' AND idade > '18'")
print (cursor.fetchall())

[(4, 'João', 33, 'joao@mentorama.com', 4), (6, 'Pedro', 32, 'pedro@mentorama.com', 'NULL'), (7, 'Izabela', 23, 'izabela@mentorama.com', 3), (8, 'Eduardo', 59, 'eduardo@mentorama.com', 4), (9, 'Tiago', 38, 'tiago@mentorama.com', 5), (10, 'Ana', 25, 'ana@mentorama.com', 'NULL'), (11, 'Carol', 36, 'carol@mentorama.com', 2), (12, 'Leonardo', 28, 'leonardo@mentorama.com', 3), (13, 'Vanessa', 45, 'vanessa@mentorama.com', 4), (14, 'João', 43, 'joaopedro@mentorama.com', 5), (15, 'Mari', 25, 'mari@mentorama.com', 6)]

### ORDER BY
Você pode solicitar que as linhas retornadas sejam ordenadas em ordem ascendente (**ASC**) ou decrescente (**DESC**), por um dos campos escolhidos, da seguinte maneira:

In [44]:
cursor.execute("SELECT nomeEstudante, idade FROM estudantes ORDER BY idade ASC")
print (cursor.fetchall())

[('Lucia', 17), ('Felipe', 18), ('Izabela', 23), ('Ana', 25), ('Mari', 25), ('Leonardo', 28), ('Pedro', 32), ('João', 33), ('Carol', 36), ('Tiago', 38), ('Maria', 40), ('João', 43), ('Maria', 45), ('Vanessa', 45), ('Eduardo', 59)]

### GROUP BY

Você pode solicitar que as linhas retornadas sejam classificadas por um dos campos escolhidos, da seguinte maneira:

In [45]:
cursor.execute("SELECT nomeEstudante, idDepartamento FROM estudantes GROUP BY nomeEstudante")
print (cursor.fetchall())

[('Ana', 'NULL'), ('Carol', 2), ('Eduardo', 4), ('Felipe', 1), ('Izabela', 3), ('João', 4), ('Leonardo', 3), ('Lucia', 2), ('Mari', 6), ('Maria', 2), ('Pedro', 'NULL'), ('Tiago', 5), ('Vanessa', 4)]

### SELECT COUNT/AVG/SUM

* A função **COUNT ()** retorna o número de linhas que correspondem a um critério especificado.

In [48]:
sql = """SELECT COUNT(nomeEstudante)
FROM estudantes
WHERE nomeEstudante = 'Mari'"""
cursor.execute(sql)
cursor.fetchall()

[(1,)]

* A função **AVG ()** retorna o valor médio de uma coluna numérica.

In [49]:
sql = """SELECT AVG(idade)
FROM estudantes
WHERE idade>'18'"""
cursor.execute(sql)
cursor.fetchall()

[(36.30769230769231,)]

* A função **SUM ()** retorna a soma total de uma coluna numérica.

In [50]:
sql = """SELECT SUM(idade)
FROM estudantes
WHERE idade > '18'"""
cursor.execute(sql)
cursor.fetchall()

[(472,)]

### INNER JOIN, LEFT JOIN e RIGHT JOIN


![INNER JOIN, LEFT JOIN e RIGHT JOIN](join.png)

### INNER JOIN

Primeiramente, vamos criar uma nova tabela chamada 'departamentos'. Através dessa tabela, iremos estabelecer uma relação com a tabela já criada 'estudantes'. Repare que nós temos o atributo **idDepartamento** em ambas as tabelas. Tal atributo nos ajudará a estabelecer relações entre as tabelas.

In [51]:
# Criando uma tabela 'departamentos' com as campos idDepartamento, nomeDepartamento
cursor.execute("CREATE TABLE departamentos (idDepartamento integer PRIMARY KEY , nomeDepartamento text)")
print("Tabela criada com sucesso!")
# Inserindo dados na tabela
# Primeiro criamos uma lista com conteúdo a ser inserido, na mesma ordem dos tipos de dados definidos
listadepartamento = [('1','TI'),
                     ('2','Fisica'),
                     ('3','Matemática'),
                     ('4','Engenharia'),
                     ('5','Biologia'),
                     ('6','História')]

# Inserimos os dados da lista dentro da tabela
cursor.executemany("""INSERT INTO departamentos VALUES (?,?)""", listadepartamento)
print("Dados inseridos com sucesso!")
banco.commit()

Tabela criada com sucesso!
Dados inseridos com sucesso!

In [ ]:
# Deleta tabela departamentos caso necessário
cursor.execute("DROP TABLE departamentos")
print("Tabela deletada com sucesso!")

In [52]:
# Consulta dados da tabela 'departamentos'
cursor.execute("SELECT * FROM departamentos")
print (cursor.fetchall())

[(1, 'TI'), (2, 'Fisica'), (3, 'Matemática'), (4, 'Engenharia'), (5, 'Biologia'), (6, 'História')]

* Neste comando iremos utilizar o **INNER JOIN** e nosso objetivo é selecionar os nomes de estudantes na tabela estudante e os seus respectivos nomes do departamento contidos na tabela departamento.
* Na cláusula Select, você pode selecionar as colunas que deseja selecionar nas duas tabelas referenciadas.
* A cláusula INNER JOIN é escrita após a primeira tabela referenciada com a cláusula "From".
* Então, a condição de junção é especificada com ON.
* A palavra INNER é opcional, você pode simplesmente escrever JOIN.

In [53]:
#
sql = """SELECT
  estudantes.nomeEstudante,
  departamentos.nomeDepartamento
FROM departamentos
INNER JOIN estudantes ON estudantes.idDepartamento = departamentos.idDepartamento"""
cursor.execute(sql)
cursor.fetchall()

#https://www.guru99.com/sqlite-join.html#:~:text=The%20INNER%20JOIN%20works%20as%20following%3A%201%20In,word%20is%20optional%2C%20you%20can%20just%20write%20JOIN.

[('Maria', 'Fisica'),
 ('Felipe', 'TI'),
 ('Maria', 'Engenharia'),
 ('João', 'Engenharia'),
 ('Lucia', 'Fisica'),
 ('Izabela', 'Matemática'),
 ('Eduardo', 'Engenharia'),
 ('Tiago', 'Biologia'),
 ('Carol', 'Fisica'),
 ('Leonardo', 'Matemática'),
 ('Vanessa', 'Engenharia'),
 ('João', 'Biologia'),
 ('Mari', 'História')]

### LEFT JOIN
* A sintaxe de LEFT JOIN é igual ao INNER JOIN: você escreve LEFT JOIN entre as duas tabelas, e então a condição de junção vem depois da cláusula ON.
* A primeira tabela após a cláusula from é a tabela à esquerda, enquanto a segunda tabela especificada após a junção à esquerda é a tabela à direita.
* A cláusula OUTER é opcional: LEFT OUTER JOIN é igual a LEFT JOIN.

In [54]:
# Estudantes é a tabela da esquerda. 
# Repare a quantidade de registros gerada pela consulta. 

sql = """SELECT
  estudantes.nomeEstudante,
  departamentos.nomeDepartamento
FROM estudantes
LEFT JOIN departamentos ON estudantes.idDepartamento = departamentos.idDepartamento"""
cursor.execute(sql)
cursor.fetchall()

[('Maria', 'Fisica'),
 ('Felipe', 'TI'),
 ('Maria', 'Engenharia'),
 ('João', 'Engenharia'),
 ('Lucia', 'Fisica'),
 ('Pedro', None),
 ('Izabela', 'Matemática'),
 ('Eduardo', 'Engenharia'),
 ('Tiago', 'Biologia'),
 ('Ana', None),
 ('Carol', 'Fisica'),
 ('Leonardo', 'Matemática'),
 ('Vanessa', 'Engenharia'),
 ('João', 'Biologia'),
 ('Mari', 'História')]

### CROSS JOIN
* Um CROSS JOIN fornece o produto cartesiano para as colunas selecionadas das duas tabelas unidas, combinando todos os valores da primeira tabela com todos os valores da segunda tabela.

* Portanto, para cada valor na primeira tabela, você obterá 'n' correspondências da segunda tabela, onde n é o número de linhas da segunda tabela.

* Ao contrário de INNER JOIN e LEFT OUTER JOIN, com CROSS JOIN, você não precisa especificar uma condição de junção, porque o SQLite não precisa dela para CROSS JOIN.

In [55]:
sql = """SELECT
  estudantes.nomeEstudante,
  departamentos.nomeDepartamento
FROM estudantes
CROSS JOIN departamentos"""
cursor.execute(sql)
cursor.fetchall()

[('Maria', 'TI'),
 ('Maria', 'Fisica'),
 ('Maria', 'Matemática'),
 ('Maria', 'Engenharia'),
 ('Maria', 'Biologia'),
 ('Maria', 'História'),
 ('Felipe', 'TI'),
 ('Felipe', 'Fisica'),
 ('Felipe', 'Matemática'),
 ('Felipe', 'Engenharia'),
 ('Felipe', 'Biologia'),
 ('Felipe', 'História'),
 ('Maria', 'TI'),
 ('Maria', 'Fisica'),
 ('Maria', 'Matemática'),
 ('Maria', 'Engenharia'),
 ('Maria', 'Biologia'),
 ('Maria', 'História'),
 ('João', 'TI'),
 ('João', 'Fisica'),
 ('João', 'Matemática'),
 ('João', 'Engenharia'),
 ('João', 'Biologia'),
 ('João', 'História'),
 ('Lucia', 'TI'),
 ('Lucia', 'Fisica'),
 ('Lucia', 'Matemática'),
 ('Lucia', 'Engenharia'),
 ('Lucia', 'Biologia'),
 ('Lucia', 'História'),
 ('Pedro', 'TI'),
 ('Pedro', 'Fisica'),
 ('Pedro', 'Matemática'),
 ('Pedro', 'Engenharia'),
 ('Pedro', 'Biologia'),
 ('Pedro', 'História'),
 ('Izabela', 'TI'),
 ('Izabela', 'Fisica'),
 ('Izabela', 'Matemática'),
 ('Izabela', 'Engenharia'),
 ('Izabela', 'Biologia'),
 ('Izabela', 'História'),
 ('Eduardo', 'TI'),
 ('Eduardo', 'Fisica'),
 ('Eduardo', 'Matemática'),
 ('Eduardo', 'Engenharia'),
 ('Eduardo', 'Biologia'),
 ('Eduardo', 'História'),
 ('Tiago', 'TI'),
 ('Tiago', 'Fisica'),
 ('Tiago', 'Matemática'),
 ('Tiago', 'Engenharia'),
 ('Tiago', 'Biologia'),
 ('Tiago', 'História'),
 ('Ana', 'TI'),
 ('Ana', 'Fisica'),
 ('Ana', 'Matemática'),
 ('Ana', 'Engenharia'),
 ('Ana', 'Biologia'),
 ('Ana', 'História'),
 ('Carol', 'TI'),
 ('Carol', 'Fisica'),
 ('Carol', 'Matemática'),
 ('Carol', 'Engenharia'),
 ('Carol', 'Biologia'),
 ('Carol', 'História'),
 ('Leonardo', 'TI'),
 ('Leonardo', 'Fisica'),
 ('Leonardo', 'Matemática'),
 ('Leonardo', 'Engenharia'),
 ('Leonardo', 'Biologia'),
 ('Leonardo', 'História'),
 ('Vanessa', 'TI'),
 ('Vanessa', 'Fisica'),
 ('Vanessa', 'Matemática'),
 ('Vanessa', 'Engenharia'),
 ('Vanessa', 'Biologia'),
 ('Vanessa', 'História'),
 ('João', 'TI'),
 ('João', 'Fisica'),
 ('João', 'Matemática'),
 ('João', 'Engenharia'),
 ('João', 'Biologia'),
 ('João', 'História'),
 ('Mari', 'TI'),
 ('Mari', 'Fisica'),
 ('Mari', 'Matemática'),
 ('Mari', 'Engenharia'),
 ('Mari', 'Biologia'),
 ('Mari', 'História')]